code-review/NRB_3471_3546/База_Было/InformationRegisters/СостоянияДокументовВФайловомШлюзе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияДокументовВФайловомШлюзе</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовФайловыйШлюз</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пакет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИсходящийПакетВФайловыйШлюз</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящийПакетИзФайловогоШлюза</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИсполнения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТехническаяОперация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/СостоянияДокументовВФайловомШлюзе/Ext/ManagerModule.bsl
// Добавляет с замещением новую запись в РС СостоянияДокументовВФайловомШлюзе.
//
// Параметры:
//  Период				 - Дата	 - период записи
//  Документ			 - ДокументСсылка.ТехническаяОперация	 - измерение "Документ"
//  СтатусПакета		 - ПеречислениеСсылка.СтатусыДокументовФайловыйШлюз	 - ресурс "Статус"
//  Пакет				 - ДокументСсылка.ИсходящийПакетВФайловыйШлюз, ДокументСсылка.ВходящийПакетИзФайловогоШлюза	 - ресурс "Пакет"
//  Комментарий			 - Строка	 - реквизит "Комментарий"
//  КоличествоИсполнения - Число	 - ресурс "КоличествоИсполнения"
//
Процедура ДобавитьЗапись(Период, Документ, СтатусПакета, Пакет = Неопределено, Комментарий = "", КоличествоИсполнения = 0) Экспорт
	
	НоваяЗаписьСостояние = РегистрыСведений.СостоянияДокументовВФайловомШлюзе.СоздатьМенеджерЗаписи();
	НоваяЗаписьСостояние.Период = Период;
	НоваяЗаписьСостояние.Документ = Документ;
	НоваяЗаписьСостояние.Статус = СтатусПакета;
	НоваяЗаписьСостояние.Пакет = Пакет;
	НоваяЗаписьСостояние.Комментарий = Комментарий;
	НоваяЗаписьСостояние.КоличествоИсполнения = КоличествоИсполнения;
	НоваяЗаписьСостояние.Записать();
	
КонецПроцедуры
